title: Account Lockout Detected
id: 17b8c9d0-e1f2-3456-abcd-789012345678
status: stable
description: Hesabın çoxlu uğursuz giriş cəhdləri səbəbi ilə avtomatik kilidlənməsini aşkarlayır.
references:
  - https://attack.mitre.org/techniques/T1110/
author: SOC team
date: 2026/06/29
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4740
  condition: selection
level: medium
tags:
  - attack.credential_access
  - attack.t1110
