title: User Added to Privileged Group
id: 7b2d0002-0000-0000-0000-000000000002
status: experimental
description: A member was added to a security-enabled privileged group
author: Aytac
date: 2026/06/30
tags:
  - attack.t1098
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID:
      - 4728
      - 4732
      - 4756
  condition: selection
level: high
