title: Windows Security Audit Log Cleared
id: 7b2d0004-0000-0000-0000-000000000004
status: experimental
description: The security event log was cleared (anti-forensics)
author: Aytac
date: 2026/06/30
tags:
  - attack.t1070.001
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 1102
  condition: selection
level: high
