title: LSASS Process Access (Credential Dumping)
id: 7b2d0007-0000-0000-0000-000000000007
status: experimental
description: A process opened a handle to lsass.exe memory (Mimikatz)
author: Aytac
date: 2026/06/30
tags:
  - attack.t1003.001
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 10
    TargetImage|endswith: '\lsass.exe'
  filter:
    SourceImage|endswith:
      - '\MsMpEng.exe'
      - '\wininit.exe'
  condition: selection and not filter
level: critical
