title: Windows Brute Force Detection
id: a1b2c3d4-e5f6-7a8b-9c0d-1e2f3a4b5c6d
status: experimental
description: Qısa zaman kəsiyində çox sayda uğursuz giriş cəhdlərini (Event ID 4625) analiz edərək Brute Force hücumlarını aşkarlayır.
author: SOC Team
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4625
    target_count:
        selection | count() > 5
    time_frame: 5m
condition: selection and target_count
level: high
tags:
    - attack.credential_access
    - attack.t1110
